
(() => {

    //* Загальне
    const template = document.querySelector("#template").innerHTML;
    const output = document.querySelector("#output");

    //* Секція Команди
    const formImage = document.querySelector('.modal__image');

    //* Форма
    const forms = document.querySelectorAll('.form-base');

    //* Підписка
    const mailingForm = document.querySelector('.mailing');



    const members = [
        {
            name: "ВІТАЛІЙ КОЧКОВИЙ",
            position: "Адвокат з бізнесу",
            imageSrc: './images/team/1-1.jpg',
            description: 'Даг является основателем юридической фирмы Batman & Co Group. Входить до складу Ради адвокатів міста Києва, є членом Київської торгово-промислової палати (Комітет з безпеки ведення бізнесу).Спеціалізація: створення бізнесу та побудова корпоративної структури в Україні та інших юрисдикціях; Допомога в управлінні бізнесом, проектами та активами;Розробка всіх видів корпоративних документів, у тому числі корпоративних договорів між учасниками та партнерських угод;Відкриття та ліквідація представництв іноземних компаній. Освіта: факультет юстиції, Національний юридичний університет імені Ярослава Мудрого(2001р.)',
        },
        {
            name: "ВОЛОДИМИР ТКАЧЕНКО",
            position: "Адвокат з інтелектуальної власності та захисту торгових марок",
            imageSrc: './images/team/2-1.jpg',
            description: 'Входить до складу Ради адвокатів міста Києва, є членом Київської торгово-промислової палати (Комітет з безпеки ведення бізнесу).Спеціалізація: надання юридичних консультацій щодо товарних знаків, авторського права, конфіденційності та трудового права. Володимир займається проектами, починаючи від реєстрації та вирішення спорів у галузі інтелектуальної власності, ліцензійних угод та угод про програмне забезпечення, закінчуючи трудовими договорами та дотриманням законодавства. Володимир отримав ступінь магістра. Освіта: факультет юстиції, Національний юридичний університет імені Ярослава Мудрого(2010р.)',
        },
        {
            name: "ВІКТОРІЯ ЗЕЙН",
            position: "Адвокат з питань нерухомості",
            imageSrc: './images/team/3-1.jpg',
            description: 'Входить до складу Ради адвокатів міста Києва, є членом Київської торгово-промислової палати (Комітет з безпеки ведення бізнесу).Спеціалізація: корпоративне право, земельне право, нерухомість та будівництво, супровід інвестиційних проектів за участю іноземних компаній, міжнародне структурування бізнесу, юридичний захист бізнесу, судова практика. Освіта: факультет юстиції, Національний юридичний університет імені Ярослава Мудрого(2000р.). Досвід роботи: понад 20 років.Юридичною практикою почала займатися з 2000 року, працювала на керівних посадах у юридичних департаментах відомих українських компаній із холдинговою структурою.Постійно проводить спеціалізовані семінари для бізнесу у Києві.',
        },
        {
            name: "ЮРІЙ КНЯЗЄВ",
            position: "Адвокат із захисту активів",
            imageSrc: './images/team/4-1.jpg',
            description: 'Юрій фокусируется на оказании помощи новым и развивающимся предприятиям.Спеціалізація: Аналіз діяльності компанії, проведення внутрішніх перевірок, структурування та оптимізація діяльності компанії.Аудит діючої системи безпеки, оцінка існуючих ризиків та розробка комплексної стратегії захисту.Аудит нематеріальних активів, їх упорядкування та створення системи захисту.Освіта: факультет юстиції, Національний юридичний університет імені Ярослава Мудрого(2005р.).',
        },
    ];

    const services = [
        {
            mainTitle: "Господарське право",
            title1: "10 років досвіду",
            description1: 'Batman & Co Group протягом майже 10 років на ринку надання юридичних, будуючи міцні відносини та унікальні знання ринку, які можуть допомогти підприємствам безперебійно здійснювати свою діяльність у регіоні.  Великий досвід компанії у цій галузі та його прагнення допомогти своїм клієнтам досягти успіху роблять його надійним партнером і порадником для будь-якого бізнесу.',
            title2: "У нас понад 300 бізнес-клієнтів.",
            description2: 'Фірма має різноманітну клієнтуру, яка включає лікарів, розробників, бухгалтерів, інвесторів. Наша компанія добре знає про труднощі, з якими стикається малий бізнес, і прагне надавати своїм клієнтам підтримку, необхідну для досягнення успіху. Ідеальні бізнес-клієнти фірми – це ті, хто шукає надійного партнера та порадника, який може допомогти їм досягти цілей, а не когось, хто просто заповнює форми.',
            title3: "Ми безпечно обробляємо великі суми грошей щороку",
            description3: 'Batman & Co Group надає низку послуг, включаючи купівлю та продаж бізнесу, фінансування та безпечну та ефективну обробку великих сум грошей. Ці завдання можуть здатися простими, але вони можуть бути надзвичайно складними та потребувати досвіду досвідчених професіоналів. Компанія має досвід обробки великих сум грошей без нарікань і хвилювань. Завдяки великому досвіду, глибокому аналізу ринку та прагненню надавати своїм клієнтам підтримку, необхідну для досягнення успіху, Batman & Co Group є чудовим партнером для компаній, які хочуть бути впевнеими у зростанні свого бінесу.',
            title4: "Послуги включають:",
            servicesArray: ['- Створення вашого бізнесу або некомерційного товариства та проведення щорічного корпоративного обслуговування, яке вимагається законом', ' - Продаж і купівля бізнесу або частини бізнесу',
                ' - Угоди, які дозволяють підприємствам працювати безперебійно, включно з корпораціями, товариствами та одноосібними підприємцями', ' - Договори управління.']
        },
        {
            mainTitle: "Нерухомість",
            title1: "Купівля чи продаж нерухомості, будь то житлової чи комерційної, є захоплюючою віхою.",
            description1: 'Для нас важливо зробити складні юридичні питання простими. Хоча нотаріуси можуть надати деякі юридичні консультації, коли мова йде про нерухоме майно, сфера їх діяльності часто обмежена. Юристи мають досвід і знання, щоб проаналізувати закон і застосувати його до вашої унікальної ситуації. Прості документи можуть бути не такими простими, тому важливо забезпечити належне юридичне забезпечення.',
            title2: "Ми усуваємо плутанину під час купівлі-продажу.",
            description2: 'Наша досвідчена команда допомогла незліченній кількості домовласників і бізнес-професіоналів легко орієнтуватися в процесі покупки. Ми впораємося з тонкощами купівлі, продажу та передачі прав власності, забезпечення іпотеки чи рефінансування, тож ви можете зосередитися на хвилюванні угоди. У сфері комерційної нерухомості ми допомагаємо власникам бізнесу з їх договорами оренди, контрактами та іншими пов’язаними питаннями. Ми також надаємо вказівки щодо планування пластів, зонування та питань землеустрою.',
            title3: "Послуги включають:",
            servicesArray: ['- Покупки житла', '- Продаж житла', '- Підрозділи житлової нерухомості, сервітути, угоди та забудови', '- Підрозділи та забудови комерційної нерухомості', '- Договори спільної власності', '- Комерційна нерухомість', '- Складання та подання звітності', '- Планування землекористування', '- Коригування та консолідація меж власності', '- Розробка транспортних структур, включаючи спільні підприємства та товариства з обмеженою відповідальністю', '- Земельні збори', '- Ведення переговорів та складання договорів на обслуговування та доступ'
            ]
        },
        {
            mainTitle: "Планування нерухомості",
            title1: "Є багато речей, які слід враховувати під час розгляду заповітів, майна та планування наприкінці життя.",
            description1: 'Складання законного заповіту є чудовою відправною точкою для планування наприкінці життя. Заповіт — це юридичний документ, який визначає, як ви хочете розподілити свої активи та інвестиції або свою «футболку» після вашої смерті. У заповіті ви також вкажете виконавців і бенефіціарів, які відповідатимуть за виконання ваших бажань і отримання частини вашого майна відповідно. Цей простий документ може позбавити вашу родину від значних судових витрат і тривалих судових розглядів. Ми розуміємо, що заповіти, майно та планування наприкінці життя можуть бути делікатними темами, і ми тут, щоб надати вказівки та підтримку в цьому процесі. Наша мета — налагодити з вами особистий зв’язок і відкриті, чесні обговорення ваших варіантів. Ми знаємо, що такі рішення можуть бути емоційними, і ми не будемо підходити до них із типовим «юристським» ставленням. Ми хочемо переконатися, що ви почуваєтеся комфортно з вашим вибором і що майбутнє ваших бенефіціарів є безпечним.',
            title2: "Ми ваші партнери в цьому.",
            description2: 'Якщо ви несете відповідальність за управління чиїмось майном після його смерті, ми можемо допомогти вам виконати ваші юридичні зобов’язання та забезпечити виконання їхніх бажань у цей делікатний час.',
            title3: "Послуги включають:",
            servicesArray: ['Допомона сформувати план нерухомості, включаючи створення юридичних документів, які є основою:', ' - Заповіти', ' - Довіреність', ' - Угоди про представництво в галузі охорони здоров`я та додаткові директиви', ' - «Живі заповіти»', ' - Перевірку, що ваш план майна є ефективним з точки зору оподаткування, включаючи перевірку прав власності та співпрацю з вами для створення індивідуального плану, який враховує всі ваші оподатковувані активи', ' - Подачу заявки на отримання заповіту, щоб ви могли довести, що ви, як виконавець, маєте остаточну, законну волю, і розпочнете врегулювання справ померлого, а також надасте іншу юридичну підтримку виконавцям'
            ]
        },
        {
            mainTitle: "Захист активів",
            title1: "Що таке захист активів?",
            description1: 'Ми пропонуємо широкий спектр консультаційних послуг для компаній, що надають фінансові послуги, включаючи фінансування придбання, реалізацію фінансової стратегії, питання реструктуризації та банкрутства, проектне фінансування, дотримання нормативних вимог і кредитні операції. Крім того, як фірма, що надає повний спектр послуг, ми надаємо рекомендації в таких спеціалізованих галузях права, як судові процеси та вирішення спорів, злиття та поглинання, ринки капіталу та зайнятість.',
            title2: "Які типи захисту активів доступні?",
            description2: 'Планування захисту активів охоплює різні методи та підходи. Як правило, юристи, які практикують у цій сфері, використовують піраміду, драбину або ступінчастий підхід, починаючи з базового планування майна та планування страхування на нижньому рівні та просуваючись до планування звільнення від шлюбу, бізнес-планування. Коли людина просувається вгору, рівень захисту зростає, як і пов’язані з цим витрати.',
            title3: "Чому захист активів?",
            description3: 'У судовій системі будь-хто може порушити позов проти будь-кого іншого, часто з незначними заслугами та з мінімальними фінансовими наслідками для позивача, якщо позов буде визнано необґрунтованим. На жаль, об’єкти цих позовів можуть зазнати значних судових витрат, захищаючись від таких позовів.',
        },
        {
            mainTitle: "Фінансові послуги",
            title1: "Ми пропонуємо допомогу в навігації в складній і конкурентоспроможній галузі фінансових послуг. Наш досвід може допомогти вам подолати юридичні та нормативні перешкоди та зменшити ризики.",
            description1: 'Вам потрібен юридичний партнер із всебічними знаннями банківських та фінансових послуг. Наша команда юристів має значний досвід консультування щодо складних фінансових операцій, розробки та реалізації фінансових стратегій, а також надання рекомендацій щодо стратегічних можливостей для досягнення ваших бізнес-цілей. Наші консультації пропонують практичні та інноваційні бізнес- та юридичні рішення в усіх аспектах банківської діяльності, реструктуризації та регулювання.',
            title2: "Що ми робимо",
            description2: 'Наші консультаційні послуги компаніям, що надають фінансові послуги, охоплюють фінансування придбання, реалізацію фінансової стратегії, питання реструктуризації та банкрутства, проектне фінансування, регуляторні питання та кредитні операції. Крім того, як фірма, що надає повний спектр послуг, ми пропонуємо консультації з таких спеціалізованих галузей права, як судові процеси та вирішення спорів, злиття та поглинання, ринки капіталу та працевлаштування.',
        },
        {
            mainTitle: "Представництво фонду",
            description1: 'Ми в Batman & Co Group пишаємося тим, що надаємо широкий спектр послуг нашим клієнтам із прямих інвестицій. Наша команда юристів може допомогти вам зорієнтуватися в складному нормативному ландшафті, який оточує формування фондів, зокрема запропонувати документацію, знайти інвесторів, залучити капітал і розробити стратегії виходу.',
            description2: 'Наша фірма використовує наш досвід у законодавстві про стартапи, корпоративні злиття та поглинання та нерухомість, а також нашу розгалужену мережу зв’язків на ринку інвесторів венчурного капіталу, щоб допомогти нашим клієнтам визначити найбільш підходящий спосіб залучення коштів. Оскільки ми представляємо різноманітні малі та зростаючі підприємства, ми маємо унікальні можливості надавати нашим клієнтам прямих інвестицій консультації з питань, які мають вирішальне значення для їхніх майбутніх портфельних компаній. Дозвольте нам використати наш досвід для вас.',
        },
    ];

    const modalCloseIcon = document.querySelectorAll('.modal__close-button');

    const body = document.querySelector('body');
    const logPadding = document.querySelectorAll('.lock-padding'); //* за наявності фіксованого контенту
    const timeout = 800;  //* тут час повинен долівнювати часу анімації в CSS
    let unlock = true;



    body.addEventListener('click', (e) => {

        if (e.target.closest('[data-member]')) {
            const currentElement = e.target.closest('[data-member]')
            processingCurrentElement(currentElement)
        }
        else if (e.target.closest('[data-service]')) {
            const currentElement = e.target.closest('[data-service]')
            processingCurrentElement(currentElement)
        }
        else if (e.target.closest('.hero__button')) {
            const currentModal = document.querySelector('#modal');
            modalOpen(currentModal);
        }
    })

    //* Подяка за відправку форми
    if (forms) {
        for (let i = 0; i < forms.length; i++) {
            const form = forms[i];
            form.addEventListener('submit', (e) => {
                e.preventDefault();
                form.reset();
                if (document.querySelector('#modal')) {
                    if (document.querySelector('#modal').classList.contains('is-open')) {
                        modalClose(e.target.closest('.modal'));
                    }
                }
                const currentModal = document.querySelector('#modal-gratitude');

                setTimeout(() => {
                    modalOpen(currentModal);
                }, 900);
            })
        }
    }

    //* Підписка
    mailingForm.addEventListener('submit', (e) => {
        e.preventDefault();
        const currentModal = document.querySelector('#modal-subscription');
        modalOpen(currentModal);
    })


    //* Відкриття модалки та напоанення template
    function processingCurrentElement(currentElemrnt) {
        const currentModal = document.getElementById('modal');
        fillTemplate(currentElemrnt)
        modalOpen(currentModal);
    }


    function fillTemplate(currentElement) {
        const currentDateAttributeValue = Object.values(currentElement.dataset)[0];
        const currentDateAttributeKey = Object.keys(currentElement.dataset)[0];
        let elementData;
        if (currentDateAttributeKey == 'member') {
            elementData = members
        }
        if (currentDateAttributeKey == 'service') {
            elementData = services
        }
        for (let i = 0; i < elementData.length; i++) {
            const currentData = elementData[i];
            if (currentDateAttributeValue == i) {
                if (currentDateAttributeKey == 'member') {
                    formImage.src = currentData.imageSrc;
                }
                let html = Mustache.render(template, currentData);
                output.insertAdjacentHTML("beforeend", html);
            }
        }
    };


    if (modalCloseIcon.length > 0) {
        for (let i = 0; i < modalCloseIcon.length; i++) {
            const element = modalCloseIcon[i];
            element.addEventListener('click', (e) => {
                modalClose(element.closest('.modal'));
                e.preventDefault();
            })

        }
    }

    function modalOpen(currentModal) {
        if (currentModal && unlock) {
            const modalActive = document.querySelector('.modal.is-open');
            if (modalActive) {
                modalClose(modalClose, false)
            } else {
                bodyLock();
            }
            currentModal.classList.add('is-open');
            currentModal.addEventListener('click', (e) => {
                if (!e.target.closest('.modal__content')) {
                    modalClose(e.target.closest('.modal'));
                }
            })
        }
    }

    function modalClose(modalActive, doUnLock = true) {  //* doUnLock = для блокування скролу якщо в попапі буду ще один попап
        if (unlock) {
            modalActive.classList.remove('is-open');
            setTimeout(() => {
                output.innerHTML = " ";  //* setTimeout чтоб не сжималась модалка 
            }, 800);
            if (doUnLock) {
                bodyUnLock();
            }
        }
    }

    function bodyLock() {
        const lockPaddingValue = window.innerWidth - document.querySelector('.wrapper').offsetWidth + 'px';
        if (logPadding.length) {    //* Для фіксованих об'єктів (за наявності)
            for (let i = 0; i < logPadding.length; i++) {
                const element = logPadding[i];
                element.style.paddingRight = lockPaddingValue;
            }
        }

        body.style.paddingRight = lockPaddingValue;
        body.classList.add('lock')

        unlock = false; //* для уникнення повторних кліків
        setTimeout(() => {
            unlock = true;
        }, timeout);
    }

    function bodyUnLock() {
        setTimeout(() => {
            if (logPadding.length) {    //* Для фіксованих об'єктів (за наявності)
                for (let i = 0; i < logPadding.length; i++) {
                    const element = logPadding[i];
                    element.style.paddingRight = '0px';
                }
            }
            body.style.paddingRight = '0px';
            body.classList.remove('lock')
        }, timeout);
        unlock = false; //* для уникнення повторних кліків
        setTimeout(() => {
            unlock = true;
        }, timeout);
    }

    document.addEventListener('keydown', (e) => {
        if (e.key === 'Escape') {
            const modalActive = document.querySelector('.modal.is-open');
            modalClose(modalActive);
        }
    })
})();




